import unittest


def assertEqual(param):
    pass


class TestFindTop3UniqueNames(unittest.TestCase):
    def find_top_3_unique_names(self, mentors_by_course):
        self.name_counts = {}
        for course in mentors_by_course:
            for mentor in course:
                first_name = mentor.split()[0]  # Берем только первое слово как имя
                self.name_counts[first_name] = self.name_counts.get(first_name, 0) + 1

        top_3_names = sorted(self.name_counts.items(), key=lambda x: x[1], reverse=True)[:3]
        result = ", ".join([f"{name}: {count} раз(а)" for name, count in top_3_names])
        return result





    def test_find_top_3_unique_names(self):
        mentors = [
            ["Евгений Шмаргунов", "Олег Булыгин", "Дмитрий Демидов", "Кирилл Табельский", "Александр Ульянцев",
             "Александр Бардин", "Александр Иванов", "Антон Солонилин", "Максим Филипенко", "Елена Никитина",
             "Азамат Искаков", "Роман Гордиенко"],
            ["Филипп Воронов", "Анна Юшина", "Иван Бочаров", "Анатолий Корсаков", "Юрий Пеньков", "Илья Сухачев",
             "Иван Маркитан", "Ринат Бибиков", "Вадим Ерошевичев", "Тимур Сейсембаев", "Максим Батырев", "Никита Шумский",
             "Алексей Степанов", "Денис Коротков", "Антон Глушков", "Сергей Индюков", "Максим Воронцов", "Евгений Грязнов",
             "Константин Виролайнен", "Сергей Сердюк", "Павел Дерендяев"],
            ["Евгений Шмаргунов", "Олег Булыгин", "Александр Бардин", "Александр Иванов", "Кирилл Табельский",
             "Александр Ульянцев", "Роман Гордиенко", "Адилет Асканжоев", "Александр Шлейко", "Алена Батицкая",
             "Денис Ежков", "Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Максим Филипенко", "Елена Никитина"],
            ["Владимир Чебукин", "Эдгар Нуруллин", "Евгений Шек", "Валерий Хаслер", "Татьяна Тен", "Александр Фитискин",
             "Александр Шлейко", "Алена Батицкая", "Александр Беспоясов", "Денис Ежков", "Николай Лопин", "Михаил Ларченко"]
        ]
        expected = "Александр: 10 раз(а), Евгений: 5 раз(а), Максим: 4 раз(а)"
        result = self.find_top_3_unique_names(mentors)
        print(result)  # Добавленный отладочный вывод
        assertEqual(result == expected)
